## 1. Charger vos données dans un DataFrame Pandas

In [72]:
import pandas as pd

**Lien de donnée https://www.kaggle.com/alexisbcook/titanic-tutorial/data**

Les options les plus courantes :
- read_csv
- read_excel

**Chargez le fichier titanica.csv à l'aide de Pandas. Stockez le résultat du chargement dans la variable df.**

In [20]:
import pandas as pd

# 1. Charger vos données dans un DataFrame Pandas
def load(file):
    # Charger vos données dans un DataFrame Pandas
    df = pd.read_csv(file)
    displayInfo(df)
    print("head")
    print(df.head())
    print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
    return df


def displayInfo(df):
    print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
    print("shape:", df.shape)
    print("line:", df.index)
    print("col :", df.columns)
    print("Describe    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
    print(df.describe)
    print("Describe () ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")
    print(df.describe(include="all"))
    print("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~")


# 1. Charger vos données dans un DataFrame Pandas
df = load("211027_titanic.csv")

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
shape: (891, 12)
line: RangeIndex(start=0, stop=891, step=1)
col : Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Describe    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
<bound method NDFrame.describe of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>
Describe () ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        PassengerId    Survived      Pclass  \
count    891.000000  891.000000  891.000000
unique          NaN         NaN         NaN
top             NaN         NaN         NaN
freq            NaN         NaN         NaN
mean     446.000000    0.383838    2.308642
std      257.353842    0.486592    0.836071
min        1.000000    0.000000    1.000000
25%      223.500000    0.000000    2.000000
50%      446.000000    0.000000    3.000000
75%      668.500000    1.000000    3.000000
max      891.000000    1.000000    3.000000

                                                     Name   Sex         Age  \
count                                                 891   891  714.000000
unique                                                891     2         NaN
top     Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengt...  male         NaN
freq                                                    1   577         NaN
mean                                                  NaN   NaN   29.699118
std                                                   NaN   NaN   14.526497
min                                                   NaN   NaN    0.420000
25%                                                   NaN   NaN   20.125000
50%                                                   NaN   NaN   28.000000
75%                                                   NaN   NaN   38.000000
max                                                   NaN   NaN   80.000000

             SibSp       Parch Ticket        Fare        Cabin Embarked
count   891.000000  891.000000    891  891.000000          204      889
unique         NaN         NaN    681         NaN          147        3
top            NaN         NaN   1601         NaN  C23 C25 C27        S
freq           NaN         NaN      7         NaN            4      644
mean      0.523008    0.381594    NaN   32.204208          NaN      NaN
std       1.102743    0.806057    NaN   49.693429          NaN      NaN
min       0.000000    0.000000    NaN    0.000000          NaN      NaN
25%       0.000000    0.000000    NaN    7.910400          NaN      NaN
50%       0.000000    0.000000    NaN   14.454200          NaN      NaN
75%       1.000000    0.000000    NaN   31.000000          NaN      NaN
max       8.000000    6.000000    NaN  512.329200          NaN      NaN
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
head
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

**Pouvez-vous afficher les 5 premières lignes du dataframe pour vérifier que les données sont bien chargées ?**

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**Combien de lignes et colonnes sont contenues dans df ?**

In [4]:
df.shape

(891, 12)

**Affichez le type des colonnes**

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

**Existe-t-il des valeurs manquantes dans ce jeu de données ?**

In [8]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

**Récuperer les noms de variables (c-à-d les noms de columns)**

In [10]:
# display 
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

 ## 2. Nettoyer votre Dataset avec drop(), dropna()

**Supprimer les variables 'PassengerId','Name','SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'**

In [30]:
import pandas as pd

# 1. Charger vos données dans un DataFrame Pandas
def load(file):
    # Charger vos données dans un DataFrame Pandas
    df = pd.read_csv(file)
    return df


# 1. Charger vos données dans un DataFrame Pandas
df = load("211027_titanic.csv")
df.drop(['PassengerId','Name','SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1)

     Survived  Pclass     Sex   Age
0           0       3    male  22.0
1           1       1  female  38.0
2           1       3  female  26.0
3           1       1  female  35.0
4           0       3    male  35.0
..        ...     ...     ...   ...
886         0       2    male  27.0
887         1       1  female  19.0
888         0       3  female   NaN
889         1       1    male  26.0
890         0       3    male  32.0

[891 rows x 4 columns]

**Vérifiez la taille de votre data**

In [31]:
import pandas as pd

# 1. Charger vos données dans un DataFrame Pandas
def load(file):
    # Charger vos données dans un DataFrame Pandas
    df = pd.read_csv(file)
    return df


# 1. Charger vos données dans un DataFrame Pandas
df = load("211027_titanic.csv")
print("before",df.shape)
df = df.drop(['PassengerId','Name','SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1)
print("after",df.shape)

before (891, 12)
after (891, 4)

**Supprimer les valeurs manquantes**

In [32]:
import pandas as pd

# 1. Charger vos données dans un DataFrame Pandas
def load(file):
    # Charger vos données dans un DataFrame Pandas
    df = pd.read_csv(file)
    return df


# 1. Charger vos données dans un DataFrame Pandas
df = load("211027_titanic.csv")
print("before",df.shape)
df = df.drop(['PassengerId','Name','SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1)
df.dropna(subset=['Age', 'Sex'])

before (891, 12)

     Survived  Pclass     Sex   Age
0           0       3    male  22.0
1           1       1  female  38.0
2           1       3  female  26.0
3           1       1  female  35.0
4           0       3    male  35.0
..        ...     ...     ...   ...
885         0       3  female  39.0
886         0       2    male  27.0
887         1       1  female  19.0
889         1       1    male  26.0
890         0       3    male  32.0

[714 rows x 4 columns]

**Vérifier la taille de votre data**

In [33]:
import pandas as pd

# 1. Charger vos données dans un DataFrame Pandas
def load(file):
    # Charger vos données dans un DataFrame Pandas
    df = pd.read_csv(file)
    return df


# 1. Charger vos données dans un DataFrame Pandas
df = load("211027_titanic.csv")
print("before",df.shape)
df = df.drop(['PassengerId','Name','SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1)
df = df.dropna(subset=['Age', 'Sex'])
print("after",df.shape)

before (891, 12)
after (714, 4)

## Groupby()

**Regrouper selon le sex votre data en appliquant la moyenne**

In [35]:
import pandas as pd

# 1. Charger vos données dans un DataFrame Pandas
def load(file):
    # Charger vos données dans un DataFrame Pandas
    df = pd.read_csv(file)
    return df


# 1. Charger vos données dans un DataFrame Pandas
df = load("211027_titanic.csv")
df = df.drop(['PassengerId','Name','SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1)
df = df.dropna(subset=['Age', 'Sex'])
print("Group BY - mean by sex")
df.groupby(['Sex']).mean()

Group BY - mean by sex

        Survived    Pclass        Age
Sex
female  0.754789  2.065134  27.915709
male    0.205298  2.335541  30.726645

**Regrouper selon le "Sex" et "Pclass" votre data en appliquant la moyenne**

In [36]:
import pandas as pd

# 1. Charger vos données dans un DataFrame Pandas
def load(file):
    # Charger vos données dans un DataFrame Pandas
    df = pd.read_csv(file)
    return df


# 1. Charger vos données dans un DataFrame Pandas
df = load("211027_titanic.csv")
df = df.drop(['PassengerId','Name','SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1)
df = df.dropna(subset=['Age', 'Sex'])
print("Group BY - mean by sex, pclass")
df.groupby(['Sex', 'Pclass']).mean()

Group BY - mean by sex

               Survived        Age
Sex    Pclass
female 1       0.964706  34.611765
       2       0.918919  28.722973
       3       0.460784  21.750000
male   1       0.396040  41.281386
       2       0.151515  30.740707
       3       0.150198  26.507589

In [37]:
import pandas as pd

# 1. Charger vos données dans un DataFrame Pandas
def load(file):
    # Charger vos données dans un DataFrame Pandas
    df = pd.read_csv(file)
    return df


# 1. Charger vos données dans un DataFrame Pandas
df = load("211027_titanic.csv")
df = df.drop(['PassengerId','Name','SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1)
df = df.dropna(subset=['Age', 'Sex'])
print("Group BY - mean by pclass, sex")
df.groupby(['Pclass', 'Sex']).mean()

Group BY - mean by pclass, sex

               Survived        Age
Pclass Sex
1      female  0.964706  34.611765
       male    0.396040  41.281386
2      female  0.918919  28.722973
       male    0.151515  30.740707
3      female  0.460784  21.750000
       male    0.150198  26.507589

## 3.  value_counts()

**Calculer le nombre de passagers qui ont une réservation $1^{ere}$ classe $2^{eme}$ classe et $3^{eme}$ classe**

In [88]:
import pandas as pd

# 1. Charger vos données dans un DataFrame Pandas
def load(file):
    # Charger vos données dans un DataFrame Pandas
    df = pd.read_csv(file)
    return df


# 1. Charger vos données dans un DataFrame Pandas
df = load("211027_titanic.csv")
df = df.drop(['PassengerId','Name','SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1)
df = df.dropna(subset=['Age', 'Sex'])
print("COUNT - mean by pclass")
df.value_counts(['Pclass'], sort=True)

3    355
1    186
2    173
Name: Pclass, dtype: int64

# 4. Fonction

**Ecrire une fontion de "category_age" qui divise la valeur age en trois parties**
si age <=20 alors retourner '<20 ans'
si 20<age <=30 retourner '20-30 ans'
si 30<age<=40 alors retourner '30-40ans' 
sinon retourner '+40 ans '

In [46]:
import pandas as pd

# 1. Charger vos données dans un DataFrame Pandas
def load(file):
    df = pd.read_csv(file)
    return df

def category_age(age):
    if age <=20 :
        return '<20 ans'
    elif 20<age <=30:
        return '20-30 ans'
    elif 30<age<=40 :
        return '30-40ans' 
    else: '+40 ans '


# 1. Charger vos données dans un DataFrame Pandas
df = load("211027_titanic.csv")
df = df.drop(['PassengerId','Name','SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1)
df = df.dropna(subset=['Age', 'Sex'])
print(df['Age'].apply(category_age))
print(df)

0      20-30 ans
1       30-40ans
2      20-30 ans
3       30-40ans
4       30-40ans
         ...
885     30-40ans
886    20-30 ans
887      <20 ans
889    20-30 ans
890     30-40ans
Name: Age, Length: 714, dtype: object
     Survived  Pclass     Sex   Age
0           0       3    male  22.0
1           1       1  female  38.0
2           1       3  female  26.0
3           1       1  female  35.0
4           0       3    male  35.0
..        ...     ...     ...   ...
885         0       3  female  39.0
886         0       2    male  27.0
887         1       1  female  19.0
889         1       1    male  26.0
890         0       3    male  32.0

[714 rows x 4 columns]

## 5. map()

**Créer des catégories d'ages avec la fonction map() de pandas**

In [47]:
import pandas as pd

# 1. Charger vos données dans un DataFrame Pandas
def load(file):
    df = pd.read_csv(file)
    return df

def category_age(age):
    if age <=20 :
        return '<20 ans'
    elif 20<age <=30:
        return '20-30 ans'
    elif 30<age<=40 :
        return '30-40ans' 
    else: '+40 ans '


# 1. Charger vos données dans un DataFrame Pandas
df = load("211027_titanic.csv")
df = df.drop(['PassengerId','Name','SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1)
df = df.dropna(subset=['Age', 'Sex'])
print(df['Age'].map(category_age))
print(df)

0      20-30 ans
1       30-40ans
2      20-30 ans
3       30-40ans
4       30-40ans
         ...
885     30-40ans
886    20-30 ans
887      <20 ans
889    20-30 ans
890     30-40ans
Name: Age, Length: 714, dtype: object
     Survived  Pclass     Sex   Age
0           0       3    male  22.0
1           1       1  female  38.0
2           1       3  female  26.0
3           1       1  female  35.0
4           0       3    male  35.0
..        ...     ...     ...   ...
885         0       3  female  39.0
886         0       2    male  27.0
887         1       1  female  19.0
889         1       1    male  26.0
890         0       3    male  32.0

[714 rows x 4 columns]

0      20-30 ans
1      30-40 ans
2      20-30 ans
3      30-40 ans
4      30-40 ans
         ...
885    30-40 ans
886    20-30 ans
887      <20 ans
889    20-30 ans
890    30-40 ans
Name: Age, Length: 714, dtype: object

**Vérifier maintenant les catécories d'Age à l'aide de .unique()**

In [49]:
import pandas as pd

# 1. Charger vos données dans un DataFrame Pandas
def load(file):
    df = pd.read_csv(file)
    return df

def category_age(age):
    if age <=20 :
        return '<20 ans'
    elif 20<age <=30:
        return '20-30 ans'
    elif 30<age<=40 :
        return '30-40ans' 
    else: '+40 ans '


# 1. Charger vos données dans un DataFrame Pandas
df = load("211027_titanic.csv")
df = df.drop(['PassengerId','Name','SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1)
df = df.dropna(subset=['Age', 'Sex'])
df['Age'].map(category_age).unique()

array(['20-30 ans', '30-40ans', None, '<20 ans'], dtype=object)

**Vérifier maintenant le nombre de catécories d'Age à l'aide de .nunique()**

In [50]:
import pandas as pd

# 1. Charger vos données dans un DataFrame Pandas
def load(file):
    df = pd.read_csv(file)
    return df

def category_age(age):
    if age <=20 :
        return '<20 ans'
    elif 20<age <=30:
        return '20-30 ans'
    elif 30<age<=40 :
        return '30-40ans' 
    else: '+40 ans '


# 1. Charger vos données dans un DataFrame Pandas
df = load("211027_titanic.csv")
df = df.drop(['PassengerId','Name','SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1)
df = df.dropna(subset=['Age', 'Sex'])
df['Age'].map(category_age).nunique()

3

## 7. cat.codes

**Encoder la variable Sex avec cat.codes (c_à-d remplacer mal par 1 et female par 0)**

In [10]:
import pandas as pd

# 1. Charger vos données dans un DataFrame Pandas
def load(file):
    df = pd.read_csv(file)
    return df

def category_age(age):
    if age <=20 :
        return '<20 ans'
    elif 20<age <=30:
        return '20-30 ans'
    elif 30<age<=40 :
        return '30-40ans' 
    else: '+40 ans '


# 1. Charger vos données dans un DataFrame Pandas
df = load("211027_titanic.csv")
df = df.drop(['PassengerId','Name','SibSp','Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1)
df = df.dropna(subset=['Age', 'Sex'])
df['Age'].map(category_age).nunique()
print("BEFORE ------------------")
print(df.dtypes)
df["Sex"]= df["Sex"].astype('category')
print("AFTER ------------------")
print(df.dtypes)
df["Sex_cat"] = df["Sex"].cat.codes
print("----------------------")
print(df)

BEFORE ------------------
Survived      int64
Pclass        int64
Sex          object
Age         float64
dtype: object
AFTER ------------------
Survived       int64
Pclass         int64
Sex         category
Age          float64
dtype: object
----------------------
     Survived  Pclass     Sex   Age  Sex_cat
0           0       3    male  22.0        1
1           1       1  female  38.0        0
2           1       3  female  26.0        0
3           1       1  female  35.0        0
4           0       3    male  35.0        1
..        ...     ...     ...   ...      ...
885         0       3  female  39.0        0
886         0       2    male  27.0        1
887         1       1  female  19.0        0
889         1       1    male  26.0        1
890         0       3    male  32.0        1

[714 rows x 5 columns]